'''
第五章 变量与运算符

5-1 什么是变量

假设有两个列表  列表A [1,2,3,4,5,6]   列表B [1,2,3]

如果 列表A 乘 3 再加上列表B 再加上列表A  

[1,2,3,4,5,6] *3 + [1,2,3] + [1,2,3,4,5,6]
这样的输入太麻烦 如果假设A是一个拥有10000个元素的列表就GG了

所以 这里引入变量 变量就好像是名字  用字母A代表列表A B代表列表B  A就是列表A的名字 

定义一个变量 A=[1,2,3,4,5,6]  B=[1,2,3]    这里的 = 是赋值符号 

print(A)   ====>  [1,2,3,4,5,6]

所以上面的题目用变量表达就会很简单了  

A*3+B+A   就是这么简单   不管你有多少个元素 都囊括在A中。。


给变量起名必须要有意义    A 就没有什么意义

action=['eat','run','stay']   action

命名的可读性要强 让别人更好地理解 (不要用拼音 不要用汉式英语 no Chinglish)  所以好好学英语




'''
