'''
5-5 运算符号

1+1=2 在这里 加号 + 就是运算符 
但是不仅仅是数字 Str 也可以使用运算符进行运算
'hello'+'world'

运算符不仅仅有 加号+ 还有 乘号 ×(*) 减号 - 除号 /  整除号 //  求余符号 %  
多次方运算符号 2次方 (**2)  3次方 (**3)  4次方(**4) 以此类推 
eg：
    100**2  100的次方    100**3  100的立方    100**5  100的5次方

运算符有很多的种类 以上所介绍的都算是 算术运算符  
算术运算符包括  +  -  ×(*)  /  //   %    ××(**)
              加  减  乘   除 整除 求余   次方

Python 运算符  
    
    算术运算符:  +   -   ×(*)  /   //    %    ××(**) 
                加  减   乘   除  整除  求余   次方

    赋值运算符:   =    +=   ×=(*=)  /=    %=   ××=(**=)  //=  -=

    比较运算符/关系运算符: ==    !=  >   <   >=  <=
    
    逻辑运算符: and  or  not  
    
    成员运算符: in    not in
    
    身份运算符:  is    is not
    
    位运算符:  &  |  ^  ~   <<  >>


'''
