'''
5-6 赋值运算符

= 等号 就是赋值运算符 

下面的符号都是需要先进性运算再赋值的 

+=   *=   -=   /=   %=   **=   //=


c=1   
Python变量不需要定义  所以上面的代码是 把 1 赋值给变量c

c=c+1 =====> c+=1 
print(c) =====> 2

c++  ++ 自增运算符    ！！但是在Python中没有自增 自减运算符 
c--  -- 自减运算符  

=============================================
加等  +=  

>>> a=3
>>> b=2
>>> b=a+b
>>> print(b)
5
>>> a=3
>>> b=2
>>> b+=a
>>> print(b)
5
=============================================
减等  -=

>>> a=3
>>> b=2
>>> b-=a    # b=b-a  b=2-3 =-1
>>> print(b)
-1
>>> a=3
>>> b=2
>>> b=b-a
>>> print(b)
-1
=============================================
乘等 *=

>>> a=3
>>> b=2
>>> b*=a
>>> print(b)
6
>>> a=3
>>> b=2
>>> b=b*a
>>> print(b)
6
=============================================

'''
