'''

3-3 十进制 二进制 八进制 十六进制

十进制  0   1   2   3   4   5   6   7   8   9   10
    以0开始   满10个数字进1  

二进制  0   1   10  11  100 101 110 111 1000
    以0开始   满2个数字进1

八进制  0   1   2   3   4   5   6   7   10  11  12  13  14
    以0开始   满8个数字进1

十六进制    0   1   2   3   4   5   6   7   8   9   A   B   C   D   E   F   
          10    11  12  13  14  15  16  17  18  19  1A  1B  1C  1D  1E  1F
          20
          以0开始   满16个数字进1 9 以后的数字以 A B C D E F 来表示

十进制 二进制 八进制 十六进制  中的 10 都代表不容的意思 虽然都是10 但是意义不同 不是同一个真实的数字 


还有其他的进制   时间  60 秒 ---->  1分钟
                    60 分钟 ----> 1 小时



'''